# SpatialElementGeometryCalculator Properties

---
The SpatialElementGeometryCalculator type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
SpatialElementGeometryCalculator Class
Autodesk.Revit.DB Namespace